
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>微服务架构的演进 · Istio深度解析与项目实践</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="赵化冰">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Istio服务网格.html" />
    
    
    <link rel="prev" href="./" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"zhaohuabing/istio-practice","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://zhaohuabing.com" target="_blank" class="custom-link">zhaohuabing.com</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    微服务架构中的基础设施
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="微服务架构的演进.html">
            
                <a href="微服务架构的演进.html">
            
                    
                    微服务架构的演进
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Istio服务网格.html">
            
                <a href="Istio服务网格.html">
            
                    
                    Istio服务网格
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="Istio控制面.html">
            
                <a href="Istio控制面.html">
            
                    
                    Istio控制面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="Istio数据面.html">
            
                <a href="Istio数据面.html">
            
                    
                    Istio数据面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="应用场景-分布式调用跟踪.html">
            
                <a href="应用场景-分布式调用跟踪.html">
            
                    
                    应用场景-分布式调用跟踪
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../debug-istio/应用场景-度量收集.md">
            
                <span>
            
                    
                    应用场景-度量收集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../debug-istio/应用场景-灰度发布.md">
            
                <span>
            
                    
                    应用场景-灰度发布
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="../debug-istio/应用场景-断路器.md">
            
                <span>
            
                    
                    应用场景-断路器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="../debug-istio/应用场景-故障注入.md">
            
                <span>
            
                    
                    应用场景-故障注入
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../debug-istio/">
            
                <a href="../debug-istio/">
            
                    
                    Istio故障定位方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../debug-istio/服务网格中的请求转发流程.html">
            
                <a href="../debug-istio/服务网格中的请求转发流程.html">
            
                    
                    请求转发流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../debug-istio/Pilot调试信息.html">
            
                <a href="../debug-istio/Pilot调试信息.html">
            
                    
                    Pilot调试信息
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../debug-istio/Envoy调试信息.html">
            
                <a href="../debug-istio/Envoy调试信息.html">
            
                    
                    Envoy调试信息
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../debug-istio/Consul调试信息.html">
            
                <a href="../debug-istio/Consul调试信息.html">
            
                    
                    Consul调试信息
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../debug-istio/协议层调试信息.html">
            
                <a href="../debug-istio/协议层调试信息.html">
            
                    
                    协议层调试信息
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >微服务架构的演进</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <p>&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x5C06;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x5207;&#x5206;&#x4E3A;&#x6570;&#x5341;&#x4E43;&#x81F3;&#x4E0A;&#x767E;&#x4E2A;&#x5C0F;&#x670D;&#x52A1;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x8D1F;&#x8D23;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x8FD9;&#x4E9B;&#x5C0F;&#x670D;&#x52A1;&#x6613;&#x4E8E;&#x88AB;&#x5C0F;&#x578B;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x56E2;&#x961F;&#x6240;&#x7406;&#x89E3;&#x548C;&#x4FEE;&#x6539;&#xFF0C;&#x5E76;&#x5E26; &#x6765;&#x4E86;&#x8BED;&#x8A00;&#x548C;&#x6846;&#x67B6;&#x9009;&#x62E9;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x7F29;&#x77ED;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4E0A;&#x7EBF;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x548C;&#x8D44;&#x6E90;&#x8981;&#x6C42;&#x5BF9;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x72EC;&#x7ACB;&#x7F29;&#x6269;&#x5BB9;&#x7B49;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x88AB;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;&#x540E;&#xFF0C;&#x8FDB;&#x7A0B;&#x5185;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x53D8;&#x6210;&#x4E86;&#x4E86;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x3002;&#x5F15;&#x5165;&#x4E86;&#x5BF9;&#x5927;&#x91CF;&#x670D;&#x52A1;&#x7684;&#x8FDE;&#x63A5;&#x3001;&#x7BA1;&#x7406;&#x548C;&#x76D1;&#x63A7;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p><img src="http://img.zhaohuabing.com/in-post/2018-03-29-what-is-service-mesh-and-istio/microservice.PNG" alt=""></p>
<p>&#x8BE5;&#x53D8;&#x5316;&#x5E26;&#x6765;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x627E;&#x5230;&#x670D;&#x52A1;&#x7684;&#x63D0;&#x4F9B;&#x65B9;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x964D;&#x4F4E;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x7684;&#x5EF6;&#x8FDF;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x8C03;&#x8BD5;&#xFF1F;</li>
</ul>
<p>&#x53E6;&#x5916;&#x751F;&#x4EA7;&#x90E8;&#x7F72;&#x4E2D;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x5B9E;&#x4F8B;&#x4E5F;&#x589E;&#x52A0;&#x4E86;&#x8FD0;&#x7EF4;&#x7684;&#x96BE;&#x5EA6;,&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x6536;&#x96C6;&#x5927;&#x91CF;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6027;&#x80FD;&#x6307;&#x6807;&#x5DF2;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5728;&#x4E0D;&#x5F71;&#x54CD;&#x4E0A;&#x7EBF;&#x4E1A;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5BF9;&#x5FAE;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x96C6;&#x7FA4;&#x90E8;&#x7F72;&#x7684;&#x5BB9;&#x9519;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x6D89;&#x53CA;&#x5230;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x901A;&#x4FE1;&#x3001;&#x7BA1;&#x7406;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x7248;&#x672C;&#x3001;&#x5B89;&#x5168;&#x3001;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x3001;&#x7B56;&#x7565;&#x6267;&#x884C;&#x3001;&#x9065;&#x6D4B;&#x548C;&#x76D1;&#x63A7;&#x7B49;&#xFF0C;&#x8981;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x5F15;&#x5165;&#x7684;&#x95EE;&#x9898;&#x5E76;&#x975E;&#x6613;&#x4E8B;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x53D1;&#x5C55;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x51FA;&#x73B0;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x5F00;&#x59CB;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x7406;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x8BAF;&#x903B;&#x8F91;&#xFF0C;&#x5305;&#x62EC;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x7194;&#x65AD;&#xFF0C;&#x91CD;&#x8BD5;&#xFF0C;&#x8D85;&#x65F6;&#xFF0C;&#x52A0;&#x5BC6;&#xFF0C;&#x9650;&#x6D41;&#x7B49;&#x903B;&#x8F91;&#x3002;</p>
<p><img src="http://img.zhaohuabing.com/in-post/2018-03-29-what-is-service-mesh-and-istio/1.png" alt=""></p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x903B;&#x8F91;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x4E3A;&#x4E86;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x3001;&#x53EF;&#x9760;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#xFF0C;&#x907F;&#x514D;&#x5927;&#x5BB6;&#x91CD;&#x590D;&#x9020;&#x8F6E;&#x5B50;&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x72AF;&#x9519;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x901A;&#x8FC7;&#x5BF9;&#x8FD9;&#x90E8;&#x5206;&#x8D1F;&#x8D23;&#x670D;&#x52A1;&#x901A;&#x8BAF;&#x7684;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x548C;&#x5F52;&#x7EB3;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5E93;&#x4F9B;&#x5404;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="http://img.zhaohuabing.com/in-post/2018-03-29-what-is-service-mesh-and-istio/2.png" alt=""></p>
<p>&#x516C;&#x5171;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#x51CF;&#x5C11;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x7531;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5355;&#x72EC;&#x5B9E;&#x73B0;&#x5FAE;&#x670D;&#x52A1;&#x901A;&#x8BAF;&#x903B;&#x8F91;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7684;&#x673A;&#x7387;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x5B58;&#x5728;&#x4E0B;&#x8FF0;&#x95EE;&#x9898;&#xFF1A;
&#x516C;&#x5171;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#x51CF;&#x5C11;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x7531;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5355;&#x72EC;&#x5B9E;&#x73B0;&#x5FAE;&#x670D;&#x52A1;&#x901A;&#x8BAF;&#x903B;&#x8F91;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7684;&#x673A;&#x7387;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x5B58;&#x5728;&#x4E0B;&#x8FF0;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5FAE;&#x670D;&#x52A1;&#x901A;&#x8BAF;&#x903B;&#x8F91;&#x5BF9;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E76;&#x4E0D;&#x900F;&#x660E;&#xFF0C;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x7406;&#x89E3;&#x5E76;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x4EE3;&#x7801;                      &#x5E93;&#xFF0C;&#x4E0D;&#x80FD;&#x5C06;&#x5176;&#x5168;&#x90E8;&#x7CBE;&#x529B;&#x805A;&#x7126;&#x4E8E;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</li>
<li>&#x9700;&#x8981;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;/&#x6846;&#x67B6;&#x5F00;&#x53D1;&#x4E0D;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x4F1A;&#x5F71;&#x54CD;&#x5FAE;&#x670D;&#x52A1;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8BED;&#x8A00;                       &#x548C;&#x6846;&#x67B6;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5F71;&#x54CD;&#x6280;&#x672F;&#x9009;&#x62E9;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;</li>
<li>&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4EE3;&#x7801;&#x5E93;&#x4F1A;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x548C;&#x5927;&#x91CF;&#x8FD0;&#x884C;                      &#x73AF;&#x5883;&#x4E2D;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5347;&#x7EA7;&#x5C06;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#x3002;</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x5C06;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x8BAF;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x548C;TCP/IP&#x534F;&#x8BAE;&#x6808;&#x8FDB;&#x884C;&#x7C7B;&#x6BD4;&#x3002;TCP/IP&#x534F;&#x8BAE;&#x6808;&#x4E3A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x901A;&#x4FE1;&#x670D;&#x52A1;&#xFF0C;&#x4F46;TCP/IP&#x534F;&#x8BAE;&#x6808;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x5E76;&#x6CA1;&#x6709;&#x7D27;&#x5BC6;&#x7684;&#x8026;&#x5408;&#x5173;&#x7CFB;&#xFF0C;&#x5E94;&#x7528;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;TCP/IP&#x534F;&#x8BAE;&#x63D0;&#x4F9B;&#x7684;&#x5E95;&#x5C42;&#x901A;&#x8BAF;&#x529F;&#x80FD;,&#x5E76;&#x4E0D;&#x5173;&#x5FC3;TCP/IP&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5982;IP&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x8DEF;&#x7531;&#xFF0C;TCP&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x94FE;&#x63A5;&#x7B49;&#x3002;</p>
<p>&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x5E94;&#x7528;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;Load balancing&#xFF0C;Retries&#xFF0C;Circuit Breaker&#x7B49;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#x3002;&#x5982;&#x679C;&#x5C06;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x901A;&#x4FE1;&#x670D;&#x52A1;&#x7684;&#x8FD9;&#x90E8;&#x5206;&#x903B;&#x8F91;&#x4ECE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x4E2D;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x90E8;&#x7F72;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x4EE3;&#x7406;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x7684;&#x67B6;&#x6784;&#xFF1A;</p>
<p><img src="http://img.zhaohuabing.com/in-post/2018-03-29-what-is-service-mesh-and-istio/sidecar.png" alt=""></p>
<p>&#x56E0;&#x4E3A;&#x901A;&#x8BAF;&#x4EE3;&#x7406;&#x8FDB;&#x7A0B;&#x4F34;&#x968F;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x4E00;&#x8D77;&#x90E8;&#x7F72;&#xFF0C;&#x56E0;&#x6B64;&#x5F62;&#x8C61;&#x5730;&#x628A;&#x8FD9;&#x79CD;&#x90E8;&#x7F72;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;&#x201C;sidecar&#x201D;/&#x8FB9;&#x8F66;&#xFF08;&#x5373;&#x4E09;&#x8F6E;&#x6469;&#x6258;&#x7684;&#x630E;&#x6597;&#xFF09;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x95F4;&#x7684;&#x6240;&#x6709;&#x6D41;&#x91CF;&#x90FD;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x4EE3;&#x7406;&#xFF0C;&#x7531;&#x4E8E;&#x4EE3;&#x7406;&#x4EE5;sidecar&#x65B9;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x4E0A;&#xFF0C;&#x5E94;&#x7528;&#x548C;&#x4EE3;&#x7406;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x8BAF;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;&#x7531;&#x4EE3;&#x7406;&#x6765;&#x8D1F;&#x8D23;&#x627E;&#x5230;&#x76EE;&#x7684;&#x670D;&#x52A1;&#x5E76;&#x8D1F;&#x8D23;&#x901A;&#x8BAF;&#x7684;&#x53EF;&#x9760;&#x6027;&#x548C;&#x5B89;&#x5168;&#x7B49;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F53;&#x670D;&#x52A1;&#x5927;&#x91CF;&#x90E8;&#x7F72;&#x65F6;&#xFF0C;&#x968F;&#x7740;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x7684;sidecar&#x4EE3;&#x7406;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x8BE5;&#x7F51;&#x683C;&#x6210;&#x4E3A;&#x4E86;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x901A;&#x8BAF;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#xFF0C;&#x627F;&#x8F7D;&#x4E86;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x6D41;&#x91CF;&#xFF0C;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;Service Mesh&#xFF08;&#x670D;&#x52A1;&#x7F51;&#x683C;&#xFF09;&#x3002;</p>
<p><img src="http://img.zhaohuabing.com/in-post/2018-03-29-what-is-service-mesh-and-istio/mesh.png" alt=""></p>
<p>_&#x670D;&#x52A1;&#x7F51;&#x683C;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#xFF0C;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x670D;&#x52A1;&#x95F4;&#x901A;&#x4FE1;&#x3002;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x6709;&#x7740;&#x590D;&#x6742;&#x7684;&#x670D;&#x52A1;&#x62D3;&#x6251;&#xFF0C;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x4FDD;&#x8BC1;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E9B;&#x62D3;&#x6251;&#x4E2D;&#x53EF;&#x9760;&#x5730;&#x7A7F;&#x68AD;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x5F53;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x901A;&#x5E38;&#x662F;&#x7531;
&#x4E00;&#x7CFB;&#x5217;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7F51;&#x7EDC;&#x4EE3;&#x7406;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F46;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<p><em>William Morgan </em><a href="https://buoyant.io/2017/04/25/whats-a-service-mesh-and-why-do-i-need-one/" target="_blank"><em>WHAT&#x2019;S A SERVICE MESH? AND WHY DO I NEED ONE?</em>
</a>_</p>
<p>&#x670D;&#x52A1;&#x7F51;&#x683C;&#x4E2D;&#x6709;&#x6570;&#x91CF;&#x4F17;&#x591A;&#x7684;Sidecar&#x4EE3;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x6BCF;&#x4E2A;&#x4EE3;&#x7406;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#xFF0C;&#x5DE5;&#x4F5C;&#x91CF;&#x5C06;&#x975E;&#x5E38;&#x5DE8;&#x5927;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x65B9;&#x4FBF;&#x5730;&#x5BF9;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x4E2D;&#x7684;&#x4EE3;&#x7406;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#x96C6;&#x4E2D;&#x63A7;&#x5236;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x4E0A;&#x589E;&#x52A0;&#x4E86;&#x63A7;&#x5236;&#x9762;
&#x7EC4;&#x4EF6;&#x3002;</p>
<p><img src="http://img.zhaohuabing.com/in-post/2018-03-29-what-is-service-mesh-and-istio/controlplane.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7C7B;&#x6BD4;SDN&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x63A7;&#x5236;&#x9762;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;SDN&#x7F51;&#x7BA1;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x8D1F;&#x8D23;&#x8DEF;&#x7531;&#x7B56;&#x7565;&#x7684;&#x6307;&#x5B9A;&#x548C;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x4E0B;&#x53D1;&#xFF1B;&#x6570;&#x636E;&#x9762;&#x7C7B;&#x4F3C;&#x4E8E;SDN&#x7F51;&#x7EDC;&#x4E2D;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x8D1F;&#x8D23;&#x6570;&#x636E;&#x5305;&#x7684;&#x8F6C;&#x53D1;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6240;&#x6709;&#x901A;&#x8BAF;&#x90FD;&#x7531;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x63D0;&#x4F9B;&#xFF0C;&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x9762;&#x677F;&#x548C;&#x6570;&#x636E;&#x9762;&#x677F;&#x7684;&#x914D;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E9B;&#x901A;&#x8BAF;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#x3001;&#x6258;&#x7BA1;&#x548C;&#x63A7;&#x5236;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x5FAE;&#x670D;&#x52A1;&#x7070;&#x5EA6;&#x53D1;&#x5E03;&#xFF0C;&#x8C03;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x8FFD;&#x8E2A;&#xFF0C;&#x6545;&#x969C;&#x6CE8;&#x5165;&#x6A21;&#x62DF;&#x6D4B;&#x8BD5;&#xFF0C;&#x52A8;&#x6001;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x95ED;&#x73AF;&#x63A7;&#x5236;&#x7B49;&#x7BA1;&#x63A7;&#x529F;&#x80FD;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; zhaohuabing.com 2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">Updated:
2019-03-15 19:13:56
</span></footer>
                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 微服务架构中的基础设施">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Istio服务网格.html" class="navigation navigation-next " aria-label="Next page: Istio服务网格">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"微服务架构的演进","level":"1.2.1","depth":2,"next":{"title":"Istio服务网格","level":"1.2.2","depth":2,"path":"content/istio-introduction/Istio服务网格.md","ref":"content/istio-introduction/Istio服务网格.md","articles":[]},"previous":{"title":"微服务架构中的基础设施","level":"1.2","depth":1,"path":"content/istio-introduction/README.md","ref":"content/istio-introduction/README.md","articles":[{"title":"微服务架构的演进","level":"1.2.1","depth":2,"path":"content/istio-introduction/微服务架构的演进.md","ref":"content/istio-introduction/微服务架构的演进.md","articles":[]},{"title":"Istio服务网格","level":"1.2.2","depth":2,"path":"content/istio-introduction/Istio服务网格.md","ref":"content/istio-introduction/Istio服务网格.md","articles":[]},{"title":"Istio控制面","level":"1.2.3","depth":2,"path":"content/istio-introduction/Istio控制面.md","ref":"content/istio-introduction/Istio控制面.md","articles":[]},{"title":"Istio数据面","level":"1.2.4","depth":2,"path":"content/istio-introduction/Istio数据面.md","ref":"content/istio-introduction/Istio数据面.md","articles":[]},{"title":"应用场景-分布式调用跟踪","level":"1.2.5","depth":2,"path":"content/istio-introduction/应用场景-分布式调用跟踪.md","ref":"content/istio-introduction/应用场景-分布式调用跟踪.md","articles":[]},{"title":"应用场景-度量收集","level":"1.2.6","depth":2,"path":"content/debug-istio/应用场景-度量收集.md","ref":"content/debug-istio/应用场景-度量收集.md","articles":[]},{"title":"应用场景-灰度发布","level":"1.2.7","depth":2,"path":"content/debug-istio/应用场景-灰度发布.md","ref":"content/debug-istio/应用场景-灰度发布.md","articles":[]},{"title":"应用场景-断路器","level":"1.2.8","depth":2,"path":"content/debug-istio/应用场景-断路器.md","ref":"content/debug-istio/应用场景-断路器.md","articles":[]},{"title":"应用场景-故障注入","level":"1.2.9","depth":2,"path":"content/debug-istio/应用场景-故障注入.md","ref":"content/debug-istio/应用场景-故障注入.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["splitter","-search","-sharing","edit-link","page-toc-button","back-to-top-button","github-buttons@2.1.0","tbfed-pagefooter@^0.0.1","disqus","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © zhaohuabing.com 2019","modify_label":"Updated:","modify_format":"YYYY-MM-DD HH:mm:ss"},"disqus":{"useIdentifier":false,"shortName":"istio-practice"},"livereload":{},"splitter":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"repo":"zhaohuabing/istio-practice","types":["star"],"size":"small"},"edit-link":{"label":"在线编辑","base":"https://github.com/zhaohuabing/istio-practice/edit/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"赵化冰","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"home":"https://zhaohuabing.com"},"title":"Istio深度解析与项目实践","language":"zh-hans","links":{"sidebar":{"zhaohuabing.com":"https://zhaohuabing.com"}},"gitbook":">=3.2.0","description":"Istio深度解析与项目实践","extension":null},"file":{"path":"content/istio-introduction/微服务架构的演进.md","mtime":"2019-03-15T11:13:56.216Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-15T11:32:28.952Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

